#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deploymenttheory/terraform-jamfpro-demo/runs/run-Z4vPXqQCbimcCcw7

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[0]: Refreshing state... [id=5044]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[4]: Refreshing state... [id=5048]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[3]: Refreshing state... [id=5047]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[2]: Refreshing state... [id=5045]
jamfpro_computer_extension_attribute.computer_extension_attribute_script_batch[1]: Refreshing state... [id=5046]
jamfpro_category.jamfpro_category_001: Refreshing state... [id=117]
data.jamfpro_category.jamfpro_category_001_data: Refreshing...
data.jamfpro_category.jamfpro_category_001_data: Refresh complete after 0s [id=117]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "JAMFPRO_CLIENT_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Z4vPXqQCbimcCcw7/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "JAMFPRO_INSTANCE_NAME"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Z4vPXqQCbimcCcw7/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.jamfpro_site.jamfpro_site_001_data will be read during apply
  # (config refers to values not yet known)
 <= data "jamfpro_site" "jamfpro_site_001_data" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # data.jamfpro_site.jamfpro_site_002 will be read during apply
  # (config refers to values not yet known)
 <= data "jamfpro_site" "jamfpro_site_002" {
      + id   = (known after apply)
      + name = (known after apply)
    }

  # jamfpro_site.jamfpro_site_001 will be created
  + resource "jamfpro_site" "jamfpro_site_001" {
      + id   = (known after apply)
      + name = "tf-ghatest-site-uk"
    }

  # jamfpro_site.site_002 will be created
  + resource "jamfpro_site" "site_002" {
      + id   = (known after apply)
      + name = "tf-ghatest-site-india"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + jamfpro_site_001_id            = (known after apply)
  + jamfpro_site_001_name          = (known after apply)
  + jamfpro_site_002_id            = (known after apply)
  + jamfpro_site_002_name          = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 8 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @ShocOne, Action: `pull_request`, Working Directory: `workload/terraform/jamfpro`, Workflow: `Terraform Plan`*